package lesson_2;

/*
      Дана переменная int year.
      Вывести на экран строку:
      «Счастливого Рождества и Нового year Года!!!
       Дед Мороз!»
*/

public class Task_9 {
    public static void main(String[] args) {

        int year = 2021;
        System.out.println( "«Счастливого Рождества и Нового" + year + "Года!!! \nДед Мороз!»");

    }
}
