package lesson_2;

/*
      Выведите на экран строку:
«Символ 'а' встречается в строке "Завтра будет хорошая погода" 4 раза.»
*/

public class Task_10 {
    public static void main(String[] args) {
        System.out.println("«Символ 'а' встречается в строке \"Завтра будет хорошая погода\" 4 раза.»");
    }

}
