package lesson_2;

/*
       Сумма всех углов треугольника равна 180 градусов.
       Даны 3 угла, вывести на экран true, если треугольник с такими углами
       существет и false - в противном случае.
*/

public class Task_4 {
    public static void main(String[] args) {

        int a = 40, b = 40, c = 100;

        System.out.println((a + b + c) == 180);

    }

}
