package lesson_2;

/*
        Создайте две переменные типа int.
        Поделите одно число на второе.
        Вывести получившийся результат.
        Сделать так, чтобы результатом вывода был тип double.
*/

public class Task3 {
    public static void main(String[] args) {

        int a = 9, b = 4;
        double c = (a * 1.0) / (b * 1.0);
        System.out.println(c);

    }
}
